PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_cryptolite_ecdsa.c
    };

    cy_stc_cryptolite_ecc_dp_type *tmpResult = NULL;

    if ((curveId > CY_CRYPTOLITE_ECC_ECP_NONE) && (curveId < CY_CRYPTOLITE_ECC_ECP_CURVES_CNT))
    {
#if defined(CY_CRYPTOLITE_CFG_ECP_DP_ED25519_ENABLED)
        if (CY_CRYPTOLITE_ECC_ECP_ED25519 == curveId)
        {
            return tmpResult;
        }
#endif /* defined(CY_CRYPTOLITE_CFG_ECP_DP_ED25519_ENABLED) */

#if defined(CY_CRYPTOLITE_CFG_ECP_DP_EC25519_ENABLED)
        if (CY_CRYPTOLITE_ECC_ECP_EC25519 == curveId)
        {
            return tmpResult;
        }
#endif /* defined(CY_CRYPTOLITE_CFG_ECP_DP_EC25519_ENABLED) */
        tmpResult = (cy_stc_cryptolite_ecc_dp_type *)&eccDomainParams[curveId];
    }

    return tmpResult;
}


/*******************************************************************************
* Function Name: Cy_Cryptolite_EC25519_GetCurveParams
****************************************************************************//**
*
* Get curve domain parameters if this curve is supported.
*
* \param curveId
* See \ref cy_en_cryptolite_ecc_curve_id_t.
*
* \return
* Pointer to curve domain parameters. See \ref cy_stc_cryptolite_ec25519_dp_type.
*
*******************************************************************************/
cy_stc_cryptolite_ec25519_dp_type *Cy_Cryptolite_EC25519_GetCurveParams(cy_en_cryptolite_ecc_curve_id_t curveId)
{
#if defined(CY_CRYPTOLITE_CFG_ECP_DP_ED25519_ENABLED) || defined(CY_CRYPTOLITE_CFG_ECP_DP_EC25519_ENABLED)
    /* ED25519 CURVE PARAMETERS */
    /* prime: "2^255 - 19" */
    /* prime: "7FFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFED" */
    CY_ALIGN(4) static const uint8_t  ed25519Prime[CY_CRYPTOLITE_ECC_ED25519_BYTE_SIZE] =
    {
        0xedu, 0xffu, 0xffu, 0xffu, 0xffu, 0xffu, 0xffu, 0xffu,
        0xffu, 0xffu, 0xffu, 0xffu, 0xffu, 0xffu, 0xffu, 0xffu,
        0xffu, 0xffu, 0xffu, 0xffu, 0xffu, 0xffu, 0xffu, 0xffu,
        0xffu, 0xffu, 0xffu, 0xffu, 0xffu, 0xffu, 0xffu, 0x7fu
    };

    /* barrett_p: "2000000000000000000000000000000000000000000000000000000000000004C" */
    CY_ALIGN(4) static const uint8_t  ed25519PrimeBarrett[CY_CRYPTOLITE_ECC_ED25519_BYTE_SIZE + 1u] =
    {
        /* pre-calculated! */
        0x4cu, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u,
        0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u,
        0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u,
        0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u,
        0x02u,
    };
#endif /* defined(CY_CRYPTOLITE_CFG_ECP_DP_ED25519_ENABLED) || defined(CY_CRYPTOLITE_CFG_ECP_DP_EC25519_ENABLED) */

#if defined(CY_CRYPTOLITE_CFG_ECP_DP_ED25519_ENABLED)
    /* order: "2^252 + 0x14def9dea2f79cd65812631a5cf5d3ed" */
    /* order: "1000000000000000000000000000000014DEF9DEA2F79CD65812631A5CF5D3ED" */
    CY_ALIGN(4) static const uint8_t  ed25519Order[CY_CRYPTOLITE_ECC_ED25519_BYTE_SIZE] =
    {
        0xedu, 0xd3u, 0xf5u, 0x5cu, 0x1au, 0x63u, 0x12u, 0x58u,
        0xd6u, 0x9cu, 0xf7u, 0xa2u, 0xdeu, 0xf9u, 0xdeu, 0x14u,
        0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u,
        0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x10u
    };

    /* barrett_o: FFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFEB2106215D086329A7ED9CE5A30A2C131B" */
    CY_ALIGN(4) static const uint8_t  ed25519OrderBarrett[CY_CRYPTOLITE_ECC_ED25519_BYTE_SIZE + 1u] =
    {
        /* pre-calculated */
        0x1bu, 0x13u, 0x2cu, 0x0au, 0xa3u, 0xe5u, 0x9cu, 0xedu,
        0xa7u, 0x29u, 0x63u, 0x08u, 0x5du, 0x21u, 0x06u, 0x21u,
        0xebu, 0xffu, 0xffu, 0xffu, 0xffu, 0xffu, 0xffu, 0xffu,
        0xffu, 0xffu, 0xffu, 0xffu, 0xffu, 0xffu, 0xffu, 0xffu,
        0x0fu,
    };

    /*A: "7FFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFEC" */
    CY_ALIGN(4) static const uint8_t  ed25519A[CY_CRYPTOLITE_ECC_ED25519_BYTE_SIZE] =
    {
        0xecu, 0xffu, 0xffu, 0xffu, 0xffu, 0xffu, 0xffu, 0xffu,
        0xffu, 0xffu, 0xffu, 0xffu, 0xffu, 0xffu, 0xffu, 0xffu,
        0xffu, 0xffu, 0xffu, 0xffu, 0xffu, 0xffu, 0xffu, 0xffu,
        0xffu, 0xffu, 0xffu, 0xffu, 0xffu, 0xffu, 0xffu, 0x7fu
    };
    /*D: "52036cee2b6ffe738cc740797779e89800700a4d4141d8ab75eb4dca135978a3" */
    CY_ALIGN(4) static const uint8_t  ed25519D[CY_CRYPTOLITE_ECC_ED25519_BYTE_SIZE] =
    {
        0xa3u, 0x78u, 0x59u, 0x13u, 0xcau, 0x4du, 0xebu, 0x75u,
        0xabu, 0xd8u, 0x41u, 0x41u, 0x4du, 0x0au, 0x70u, 0x00u,
        0x98u, 0xe8u, 0x79u, 0x77u, 0x79u, 0x40u, 0xc7u, 0x8cu,
        0x73u, 0xfeu, 0x6fu, 0x2bu, 0xeeu, 0x6cu, 0x03u, 0x52u
    };

    /*(X(P),Y(P)) of edwards25519 in RFC7748*/
    /* base point x: "151122213495354007725011514095885315114540126930418572060461132
      83949847762202" */
    CY_ALIGN(4) static const uint8_t  ed25519BasePointX[CY_CRYPTOLITE_ECC_ED25519_BYTE_SIZE] =
    {
        0x1au, 0xd5u, 0x25u, 0x8fu, 0x60u, 0x2du, 0x56u, 0xc9u,
        0xb2u, 0xa7u, 0x25u, 0x95u, 0x60u, 0xc7u, 0x2cu, 0x69u,
        0x5cu, 0xdcu, 0xd6u, 0xfdu, 0x31u, 0xe2u, 0xa4u, 0xc0u,
        0xfeu, 0x53u, 0x6eu, 0xcdu, 0xd3u, 0x36u, 0x69u, 0x21u,
    };

    /* base point y: "463168356949264781694283940034751631413079938662562256157830336
      03165251855960" */
    CY_ALIGN(4) static const uint8_t  ed25519BasePointY[CY_CRYPTOLITE_ECC_ED25519_BYTE_SIZE] =
    {
        0x58u, 0x66u, 0x66u, 0x66u, 0x66u, 0x66u, 0x66u, 0x66u,
        0x66u, 0x66u, 0x66u, 0x66u, 0x66u, 0x66u, 0x66u, 0x66u,
        0x66u, 0x66u, 0x66u, 0x66u, 0x66u, 0x66u, 0x66u, 0x66u,
        0x66u, 0x66u, 0x66u, 0x66u, 0x66u, 0x66u, 0x66u, 0x66u,
    };

    if (curveId == CY_CRYPTOLITE_ECC_ECP_ED25519)
    {
        static cy_stc_cryptolite_ec25519_dp_type g_dp;
        cy_stc_cryptolite_ec25519_dp_type *dp = &g_dp;
        dp->id          = CY_CRYPTOLITE_ECC_ECP_ED25519;
        dp->size        = CY_CRYPTOLITE_ECC_ED25519_SIZE;
        dp->name        = "Edward's ED25519";
        dp->algo        = CY_CRYPTOLITE_NIST_P_BARRETT_RED_ALG;
        dp->prime       = ed25519Prime;
        dp->barrett_p   = ed25519PrimeBarrett;
        dp->order       = ed25519Order;
        dp->barrett_o   = ed25519OrderBarrett;
        dp->d           = ed25519D;
        dp->a           = ed25519A;
        dp->Gx          = ed25519BasePointX;
        dp->Gy          = ed25519BasePointY;
        dp->barret_osize = 260u;                     /* barret_o = (2^512(513 bits)/ed25519Order(253 bits) */
        dp->barret_psize = 258u;                     /* barret_p = (2^512(513 bits)/ed25519Prime(255 bits) */

