PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_cryptolite_ecdsa.c
        return dp;
    }

#endif /* defined(CY_CRYPTOLITE_CFG_ECP_DP_ED25519_ENABLED) */

#if defined(CY_CRYPTOLITE_CFG_ECP_DP_EC25519_ENABLED)
    /*A24: "(486662 + 2)/4 = 121665" */
    CY_ALIGN(4) static const uint8_t  ec25519A[3] =
    {
        0x41u, 0xDBu, 0x01u
    };
    /* base point x: "9" */
    CY_ALIGN(4) static const uint8_t  ec25519BasePointX[CY_CRYPTOLITE_ECC_EC25519_BYTE_SIZE] =
    {
        0x09u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u,
        0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u,
        0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u,
        0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u
    };

    if (curveId == CY_CRYPTOLITE_ECC_ECP_EC25519)
    {
        static cy_stc_cryptolite_ec25519_dp_type g_dp;
        cy_stc_cryptolite_ec25519_dp_type *dp = &g_dp;
        dp->id          = CY_CRYPTOLITE_ECC_ECP_EC25519;
        dp->size        = CY_CRYPTOLITE_ECC_EC25519_SIZE;
        dp->name        = "ECC EC25519";
        dp->algo        = CY_CRYPTOLITE_NIST_P_BARRETT_RED_ALG;
        dp->prime       = ed25519Prime;
        dp->barrett_p   = ed25519PrimeBarrett;
        dp->order       = NULL;
        dp->barrett_o   = NULL;
        dp->d           = NULL;
        dp->a           = ec25519A;
        dp->Gx          = ec25519BasePointX;
        dp->Gy          = NULL;
        dp->barret_osize = 0;
        dp->barret_psize = 258u;                   /* barret_p = (2^512(513 bits)/ed25519Prime(255 bits) */

        return dp;
    }

#endif /*defined(CY_CRYPTOLITE_CFG_ECP_DP_EC25519_ENABLED)*/

    (void)curveId;
    return NULL;
}

/*******************************************************************************
* Function Name: Cy_Cryptolite_ECC_Init
****************************************************************************//*
*
* Init ECC Context.
*
* \param base
* The pointer to a Cryptolite instance.
*
* \param cfContext
* The pointer to the cy_stc_cryptolite_context_ecdsa_t.
*
* \param eccBuffer
* The pointer to the cy_stc_cryptolite_ecc_buffer_t.
*
* \return status code. See \ref cy_en_cryptolite_status_t.
*
*******************************************************************************/
cy_en_cryptolite_status_t Cy_Cryptolite_ECC_Init(CRYPTOLITE_Type *base,
        cy_stc_cryptolite_context_ecdsa_t *cfContext,
        cy_stc_cryptolite_ecc_buffer_t *eccBuffer)
{
    if (base == NULL || cfContext == NULL || eccBuffer == NULL)
    {
        return CY_CRYPTOLITE_BAD_PARAMS;
    }

    cfContext->my_BARRETT_U = eccBuffer->my_BARRETT_U;
    cfContext->my_P         = eccBuffer->my_P;
    cfContext->dividend     = eccBuffer->dividend;
    cfContext->p_r          = eccBuffer->p_r;
    cfContext->p_s          = eccBuffer->p_s;
    cfContext->p_u1         = eccBuffer->p_u1;
    cfContext->p_u2         = eccBuffer->p_u2;
    cfContext->p_o          = eccBuffer->p_o;
    cfContext->p_gx         = eccBuffer->p_gx;
    cfContext->p_gy         = eccBuffer->p_gy;
    cfContext->p_qx         = eccBuffer->p_qx;
    cfContext->p_qy         = eccBuffer->p_qy;
    cfContext->p_buf         = eccBuffer->p_buf;

    return CY_CRYPTOLITE_SUCCESS;
}

/*******************************************************************************
* Function Name: Cy_Cryptolite_ECC_Free
****************************************************************************//*
*
* Clean up ECC Context.
*
* \param base
* The pointer to a Cryptolite instance.
*
* \param cfContext
* The pointer to the cy_stc_cryptolite_context_ecdsa_t.
*
* \return status code. See \ref cy_en_cryptolite_status_t.
*
*******************************************************************************/
cy_en_cryptolite_status_t Cy_Cryptolite_ECC_Free(CRYPTOLITE_Type *base,
        cy_stc_cryptolite_context_ecdsa_t *cfContext)
{
    if (base == NULL || cfContext == NULL)
    {
        return CY_CRYPTOLITE_BAD_PARAMS;
    }

    if (cfContext->my_BARRETT_U != NULL)
    {
        Cy_Cryptolite_Vu_clr(cfContext->my_BARRETT_U, VU_BITS_TO_WORDS(BIT_SIZE + 1U));
        cfContext->my_BARRETT_U = NULL;
    }
    if (cfContext->my_P != NULL)
    {
        Cy_Cryptolite_Vu_clr(cfContext->my_P, VU_BITS_TO_WORDS(BIT_SIZE));
        cfContext->my_P = NULL;
    }
    if (cfContext->dividend != NULL)
    {
        Cy_Cryptolite_Vu_clr(cfContext->dividend, VU_BITS_TO_WORDS(BIT_SIZE));
        cfContext->dividend = NULL;
    }
    if (cfContext->p_r != NULL)
    {
        Cy_Cryptolite_Vu_clr(cfContext->p_r, VU_BITS_TO_WORDS(BIT_SIZE));
        cfContext->p_r = NULL;
    }
    if (cfContext->p_s != NULL)
    {
        Cy_Cryptolite_Vu_clr(cfContext->p_s, VU_BITS_TO_WORDS(BIT_SIZE));
        cfContext->p_s = NULL;
    }
    if (cfContext->p_u1 != NULL)
    {
        Cy_Cryptolite_Vu_clr(cfContext->p_u1, VU_BITS_TO_WORDS(BIT_SIZE));
        cfContext->p_u1 = NULL;
    }
    if (cfContext->p_u2 != NULL)
    {
        Cy_Cryptolite_Vu_clr(cfContext->p_u2, VU_BITS_TO_WORDS(BIT_SIZE));
        cfContext->p_u2 = NULL;
    }
    if (cfContext->p_o != NULL)
    {
        Cy_Cryptolite_Vu_clr(cfContext->p_o, VU_BITS_TO_WORDS(BIT_SIZE));
        cfContext->p_o = NULL;
    }
    if (cfContext->p_gx != NULL)
    {
        Cy_Cryptolite_Vu_clr(cfContext->p_gx, VU_BITS_TO_WORDS(BIT_SIZE));
        cfContext->p_gx = NULL;
    }
    if (cfContext->p_gy != NULL)
    {
        Cy_Cryptolite_Vu_clr(cfContext->p_gy, VU_BITS_TO_WORDS(BIT_SIZE));
        cfContext->p_gy = NULL;
    }
    if (cfContext->p_qx != NULL)
    {
        Cy_Cryptolite_Vu_clr(cfContext->p_qx, VU_BITS_TO_WORDS(BIT_SIZE));
        cfContext->p_qx = NULL;
    }
    if (cfContext->p_qy != NULL)
    {
        Cy_Cryptolite_Vu_clr(cfContext->p_qy, VU_BITS_TO_WORDS(BIT_SIZE));
        cfContext->p_qy = NULL;
    }
    if (cfContext->p_buf != NULL)
    {
        Cy_Cryptolite_Vu_clr(cfContext->p_buf, VU_BITS_TO_WORDS(BIT_SIZE + 1U));
        cfContext->p_buf = NULL;
    }
    return CY_CRYPTOLITE_SUCCESS;
}


/*******************************************************************************
* Function Name: Cy_Cryptolite_ECC_SharedSecret
****************************************************************************//**
*
* Generate a Shared Secret key from one private key and others public key.
*
* \param base
* The pointer to a Cryptolite instance.
*
* \param cfContext
* The pointer to the cy_stc_cryptolite_context_ecdsa_t.
*
* \param curveID
* The ECC curve id.
*
* \param privateKey
* The pointer to the ECC private key.
*
* \param key
* The generated public ECC key. See \ref cy_stc_cryptolite_ecc_key.
*
* \param sharedSecret
* The pointer to store the generated shared Secret.
*
* \return status code. See \ref cy_en_cryptolite_status_t.
*
****************************************************************************/
cy_en_cryptolite_status_t Cy_Cryptolite_ECC_SharedSecret(CRYPTOLITE_Type *base,
        cy_stc_cryptolite_context_ecdsa_t *cfContext,
        cy_en_cryptolite_ecc_curve_id_t curveID, const uint8_t *privateKey,
        const cy_stc_cryptolite_ecc_key *key,
        uint8_t const *sharedSecret)
{

