PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_cryptolite_ecdsa.c
    cy_en_cryptolite_status_t result = CY_CRYPTOLITE_BAD_PARAMS;
    const cy_stc_cryptolite_ecc_dp_type *eccDp;

    /* NULL parameters checking */
    if ((base != NULL) && (cfContext != NULL) && (privateKey != NULL) && (key != NULL) &&
            (key->pubkey.x != NULL) && (key->pubkey.y != NULL) && (sharedSecret != NULL))
    {

        result = CY_CRYPTOLITE_NOT_SUPPORTED;
        eccDp = Cy_Cryptolite_ECC_GetCurveParams(curveID);

        if (eccDp != NULL)
        {
            uint8_t *p_u1 = cfContext->p_u1;
            uint8_t *p_o = cfContext->p_o;
            uint8_t *p_gx = cfContext->p_gx;
            uint8_t *p_gy = cfContext->p_gy;
            uint8_t *my_P = cfContext->my_P;
            uint8_t *my_BARRETT_U = cfContext->my_BARRETT_U;

            uint32_t bitsize  = eccDp->size;
            uint32_t bytesize = VU_BITS_TO_BYTES(eccDp->size);

            cfContext->bitsize = bitsize;


            // Initialize point multiplication
            // load prime, order and barrett coefficient
            Cy_Cryptolite_Setnumber(my_P, (uint8_t *) eccDp->prime, bytesize);
            Cy_Cryptolite_Setnumber(p_o, (uint8_t *) eccDp->order, bytesize);
            Cy_Cryptolite_Setnumber(my_BARRETT_U, (uint8_t *) eccDp->barrett_p, VU_BITS_TO_BYTES(bitsize + 1U));

            // load base Point G
            Cy_Cryptolite_Setnumber(p_gx, (uint8_t *) key->pubkey.x, bytesize);
            Cy_Cryptolite_Setnumber(p_gy, (uint8_t *) key->pubkey.y, bytesize);
            Cy_Cryptolite_Setnumber(p_u1, (uint8_t *)privateKey, bytesize);


            Cy_Cryptolite_EC_NistP_PointMul(base, cfContext, p_gx, p_gy, p_u1, p_o, (int)bitsize);

            Cy_Cryptolite_Setnumber((uint8_t *)sharedSecret, (uint8_t *) p_gx, bytesize);
            result = CY_CRYPTOLITE_SUCCESS;

        }
        else
        {
            result = CY_CRYPTOLITE_NOT_SUPPORTED;
        }
    }
    return result;
}

#if defined(CY_CRYPTOLITE_CFG_ECDSA_SIGN_C)
/*******************************************************************************
* Function Name: Cy_Cryptolite_ECC_SignHash
****************************************************************************//*
*
* Function to generate an ECC signature.
* key, hash and messageKey must be in little endian.
* Cy_Cryptolite_InvertEndianness() function is used for converting the endianness.
*
* \param base
* The pointer to a Cryptolite instance.
*
* \param cfContext
* The pointer to the cy_stc_cryptolite_context_ecdsa_t.
*
* \param hash
* The hash (message digest) to be signed.
*
* \param hashlen
* The length of the hash (octets).
*
* \param sig
* The pointer to the buffer to store the generated signature 'R' followed by 'S'.
*
* \param key
* The  private ECC key to sign the hash. See \ref cy_stc_cryptolite_ecc_key.
*
* \param messageKey
* The random number for generating the signature.
*
* \return status code. See \ref cy_en_cryptolite_status_t.
*
*******************************************************************************/
cy_en_cryptolite_status_t Cy_Cryptolite_ECC_SignHash(CRYPTOLITE_Type *base,
        cy_stc_cryptolite_context_ecdsa_t *cfContext, const uint8_t *hash, uint32_t hashlen, uint8_t *sig,
        const cy_stc_cryptolite_ecc_key *key, const uint8_t *messageKey)
{
    cy_en_cryptolite_status_t result = CY_CRYPTOLITE_BAD_PARAMS;
    const cy_stc_cryptolite_ecc_dp_type *eccDp;

    /* NULL parameters checking */
    if ((base != NULL) && (sig != NULL) && (hash != NULL) && (0u != hashlen) && (key != NULL) && (messageKey != NULL))
    {
        cy_stc_cryptolite_descr_t *vu_struct0 = &cfContext->vu_desptr[0];
        cy_stc_cryptolite_descr_t *vu_struct1 = &cfContext->vu_desptr[1];

        result = CY_CRYPTOLITE_NOT_SUPPORTED;
        eccDp = Cy_Cryptolite_ECC_GetCurveParams(key->curveID);

        if (eccDp != NULL)
        {
            uint8_t *p_r = cfContext->p_r;
            uint8_t *p_s = cfContext->p_s;
            uint8_t *p_u1 = cfContext->p_u1;
            uint8_t *p_u2 = cfContext->p_u2;
            uint8_t *my_P = cfContext->my_P;
            uint8_t *my_BARRETT_U = cfContext->my_BARRETT_U;
            uint32_t bytesize = VU_BITS_TO_BYTES(eccDp->size);
            uint32_t bitsize  = eccDp->size;
            CY_ALIGN(4) uint8_t temp[VU_BITS_TO_BYTES(VU_TEST_EQUAL_LESS_SIZE + 1U)] = {0};
            cy_stc_cryptolite_ecc_key publicKey;
            uint8_t pubkey[128];

            publicKey.pubkey.x = pubkey;
            publicKey.pubkey.y = &pubkey[bytesize];

            //Generate the public key
            result = Cy_Cryptolite_ECC_MakePublicKey(base, cfContext, key->curveID,  //(x1, y1) = k * G.
                     messageKey, &publicKey);

            if (CY_CRYPTOLITE_SUCCESS != result)
            {
                return result;
            }

            // load prime, order and barrett coefficient
            Cy_Cryptolite_Setnumber(my_P, (uint8_t *) eccDp->order, bytesize);
            Cy_Cryptolite_Setnumber(my_BARRETT_U, (uint8_t *) eccDp->barrett_o, VU_BITS_TO_BYTES(bitsize + 1U));

            Cy_Cryptolite_Setnumber(p_r, (uint8_t *)publicKey.pubkey.x, bytesize);

            if (Cy_Cryptolite_Vu_test_zero(base, vu_struct0, p_r, (uint16_t)bitsize) == true)
            {
                return CY_CRYPTOLITE_BAD_PARAMS;
            }

            // Setting the R component of the signature  // r = x1
            if (Cy_Cryptolite_Vu_test_less_than(base, vu_struct1, p_r, my_P, (uint16_t)bitsize) == false)
            {
                (void)Cy_Cryptolite_Vu_mov_hw(base, vu_struct0, temp, VU_BITS_TO_WORDS(bitsize + 1U), p_r, VU_BITS_TO_WORDS(bitsize));
                Cy_Cryptolite_EC_Bar_MulRed(base, cfContext, p_r, temp, bitsize);
                if (Cy_Cryptolite_Vu_test_zero(base, vu_struct0, p_r, (uint16_t)bitsize) == true)
                {
                    return CY_CRYPTOLITE_BAD_PARAMS;
                }
                Cy_Cryptolite_Setnumber(sig, (uint8_t *)p_r, bytesize);
            }
            else
            {
                Cy_Cryptolite_Setnumber(sig, (uint8_t *)publicKey.pubkey.x, bytesize);
            }

            // d*r mod n
            Cy_Cryptolite_Setnumber(p_u2, (uint8_t *)key->k, bytesize);
            Cy_Cryptolite_EC_MulMod(base, cfContext, p_s, p_u2, p_r, (int)bitsize);

            // load message hash, truncate it if needed
            Cy_Cryptolite_Vu_wait_hw(base);
            Cy_Cryptolite_Vu_clr(p_u1, VU_BITS_TO_WORDS(bitsize));
            if (hashlen * 8U > bitsize)
            {
                Cy_Cryptolite_Setnumber(p_u1, (uint8_t *)(&hash[hashlen - CY_CRYPTOLITE_BYTE_SIZE_OF_BITS(bitsize)]), CY_CRYPTOLITE_BYTE_SIZE_OF_BITS(bitsize));
            }
            else
            {
                Cy_Cryptolite_Setnumber(p_u1, (uint8_t *)hash, hashlen);
            }

            // e + d*r mod n
            Cy_Cryptolite_EC_AddMod(base, cfContext, p_s, p_u1, p_s);

            // z = a / b % mod
            Cy_Cryptolite_Vu_wait_hw(base);
            (void)Cy_Cryptolite_Vu_mov_hw(base, vu_struct0, temp, VU_BITS_TO_WORDS(bitsize + 1U), p_s, VU_BITS_TO_WORDS(bitsize));

