PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_cryptolite_ecdsa.c
            Cy_Cryptolite_Setnumber(p_u1, (uint8_t *)messageKey, bytesize);

            // (e + d*r)/k  mod n
            Cy_Cryptolite_EC_DivMod(base, cfContext, p_s, temp, p_u1, (int)bitsize);

            if (Cy_Cryptolite_Vu_test_zero(base, vu_struct0, p_s, (uint16_t)bitsize) == true)
            {
                return CY_CRYPTOLITE_BAD_PARAMS;
            }

            Cy_Cryptolite_Setnumber(&sig[bytesize], (uint8_t *)p_s, bytesize);
            result = CY_CRYPTOLITE_SUCCESS;
        }
    }

    return result;
}
#endif

#if defined(CY_CRYPTOLITE_CFG_ECDSA_VERIFY_C)
/*******************************************************************************
* Function Name: Cy_Cryptolite_Core_ECC_VerifyHash
****************************************************************************//*
*
* Verify an ECC signature.
* sig, hash and key must be in little endian.
* Cy_Cryptolite_InvertEndianness() function is used for converting the endianness.
*
* \param base
* The pointer to a Cryptolite instance.
*
* \param cfContext
* The pointer to the cy_stc_cryptolite_context_ecdsa_t.
*
* \param sig
* The signature to verify, 'R' followed by 'S'.
*
* \param siglen
* The length of signature.
*
* \param hash
* The hash (message digest) that was signed.
*
* \param hashlen
* The length of the hash (octets).
*
* \param stat
* Result of signature, 0xAAAAAAAA = invalid, 0x55555555 = valid.
*
* \param key
* The corresponding public ECC key. See \ref cy_stc_cryptolite_ecc_key.
*
* \return status code. See \ref cy_en_cryptolite_status_t.
*
*******************************************************************************/
cy_en_cryptolite_status_t Cy_Cryptolite_ECC_VerifyHash(CRYPTOLITE_Type *base,
        cy_stc_cryptolite_context_ecdsa_t *cfContext,
        const uint8_t *sig, uint32_t siglen, const uint8_t *hash, uint32_t hashlen,
        cy_en_cryptolite_sig_verify_result_t *stat, const cy_stc_cryptolite_ecc_key *key)
{

    cy_en_cryptolite_status_t result = CY_CRYPTOLITE_BAD_PARAMS;
    const cy_stc_cryptolite_ecc_dp_type *eccDp;
    (void)siglen;


    /* NULL parameters checking */
    if ((sig != NULL) && (hash != NULL) && (0u != hashlen) && (stat != NULL) && (key != NULL) && (cfContext != NULL))
    {
        cy_stc_cryptolite_descr_t *vu_struct0 = &cfContext->vu_desptr[0];
        cy_stc_cryptolite_descr_t *vu_struct1 = &cfContext->vu_desptr[1];

        result = CY_CRYPTOLITE_NOT_SUPPORTED;
        eccDp = Cy_Cryptolite_ECC_GetCurveParams(key->curveID);

        if (eccDp != NULL)
        {
            uint8_t *dividend = cfContext->dividend;
            uint8_t *p_r = cfContext->p_r;
            uint8_t *p_s = cfContext->p_s;
            uint8_t *p_u1 = cfContext->p_u1;
            uint8_t *p_u2 = cfContext->p_u2;
            uint8_t *p_o = cfContext->p_o;
            uint8_t *p_gx = cfContext->p_gx;
            uint8_t *p_gy = cfContext->p_gy;
            uint8_t *p_qx = cfContext->p_qx;
            uint8_t *p_qy = cfContext->p_qy;
            uint8_t *my_P = cfContext->my_P;
            uint8_t *my_BARRETT_U = cfContext->my_BARRETT_U;

            uint32_t bitsize  = eccDp->size;
            uint32_t bytesize = VU_BITS_TO_BYTES(eccDp->size);
            bool isHashZero = false;

            *stat = CY_CRYPTOLITE_SIG_INVALID;
            cfContext->bitsize = bitsize;
            /* load values needed for reduction modulo order of the base point */
            Cy_Cryptolite_Setnumber(my_P, (uint8_t *)eccDp->order, VU_BITS_TO_BYTES(bitsize));
            Cy_Cryptolite_Setnumber(my_BARRETT_U, (uint8_t *)eccDp->barrett_o, VU_BITS_TO_BYTES(bitsize + 1U));

            /* check that R and S are within the valid range, i.e. 0 < R < n and 0 < S < n */
            Cy_Cryptolite_Setnumber(p_r, (uint8_t *)sig, bytesize);
            Cy_Cryptolite_Setnumber(p_s, (uint8_t *)&sig[VU_BITS_TO_BYTES(bitsize)], bytesize);

            if (Cy_Cryptolite_Vu_test_zero(base, vu_struct0, p_r, (uint16_t)bitsize) == true)
            {
                return CY_CRYPTOLITE_BAD_PARAMS;
            }
            if (Cy_Cryptolite_Vu_test_less_than(base, vu_struct1, p_r, my_P, (uint16_t)bitsize) == false)
            {
                return CY_CRYPTOLITE_BAD_PARAMS;
            }
            if (Cy_Cryptolite_Vu_test_zero(base, vu_struct0, p_s, (uint16_t)bitsize) == true)
            {
                return CY_CRYPTOLITE_BAD_PARAMS;
            }
            if (Cy_Cryptolite_Vu_test_less_than(base, vu_struct1, p_s, my_P, (uint16_t)bitsize) == false)
            {
                return CY_CRYPTOLITE_BAD_PARAMS;
            }
            // load message hash, truncate it if needed
            Cy_Cryptolite_Vu_wait_hw(base);
            Cy_Cryptolite_Vu_clr(p_u1, VU_BITS_TO_WORDS(bitsize));
            if (hashlen * 8U > bitsize)
            {
                Cy_Cryptolite_Setnumber(p_u1, (uint8_t *)(&hash[hashlen - CY_CRYPTOLITE_BYTE_SIZE_OF_BITS(bitsize)]), CY_CRYPTOLITE_BYTE_SIZE_OF_BITS(bitsize));
            }
            else
            {
                Cy_Cryptolite_Setnumber(p_u1, (uint8_t *)hash, hashlen);
            }
            /* Check if message hash is zero */
            if (Cy_Cryptolite_Vu_test_zero(base, vu_struct1, p_u1, (uint16_t)bitsize))
            {
                isHashZero = true;
            }
            // w = s^-1 mod n
            Cy_Cryptolite_Vu_wait_hw(base);
            Cy_Cryptolite_Vu_clr(dividend, VU_BITS_TO_WORDS(bitsize));
            Cy_Cryptolite_Vu_set_bit(dividend, 0);

            Cy_Cryptolite_EC_DivMod(base, cfContext, p_s, dividend, p_s, (int)bitsize);

            // u1 = e*w mod n
            Cy_Cryptolite_EC_MulMod(base, cfContext, p_u1, p_u1, p_s, (int)bitsize);
            // u2 = r*w mod n
            Cy_Cryptolite_EC_MulMod(base, cfContext, p_u2, p_r, p_s, (int)bitsize);

            //-----------------------------------------------------------------------------
            // Initialize point multiplication
            //
            // load prime, order and barrett coefficient
            Cy_Cryptolite_Setnumber(my_P, (uint8_t *) eccDp->prime, bytesize);
            Cy_Cryptolite_Setnumber(p_o, (uint8_t *) eccDp->order, bytesize);
            Cy_Cryptolite_Setnumber(my_BARRETT_U, (uint8_t *) eccDp->barrett_p, VU_BITS_TO_BYTES(bitsize + 1U));
            // load base Point G
            Cy_Cryptolite_Setnumber(p_gx, (uint8_t *) eccDp->Gx, bytesize);
            Cy_Cryptolite_Setnumber(p_gy, (uint8_t *) eccDp->Gy, bytesize);
            // load public key Qa
            Cy_Cryptolite_Setnumber(p_qx, (uint8_t *)key->pubkey.x, bytesize);
            Cy_Cryptolite_Setnumber(p_qy, (uint8_t *)key->pubkey.y, bytesize);
            // u1 * G
            if (!isHashZero)
            {
                Cy_Cryptolite_EC_NistP_PointMul(base, cfContext, p_gx, p_gy, p_u1, p_o, (int)bitsize);
            }

            // reload order since p_o is modified by Crypto_EC_JacobianEcScalarMul_coZ (!!!!)
            Cy_Cryptolite_Setnumber(p_o, (uint8_t *) eccDp->order, bytesize);

