PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_cryptolite_ecdsa.c
            // u2 * Qa
            Cy_Cryptolite_EC_NistP_PointMul(base, cfContext, p_qx, p_qy, p_u2, p_o, (int)bitsize);

            //-----------------------------------------------------------------------------
            // P = u1 * G + u2 * Qa. Only Px is needed

            if (isHashZero)
            {
                /* GECC 3.22 */
                Cy_Cryptolite_Setnumber(p_s, p_qx, bytesize);
            }
            else
            {
                Cy_Cryptolite_EC_SubMod(base, cfContext, dividend, p_qy, p_gy);     // (y2-y1)
                Cy_Cryptolite_EC_SubMod(base, cfContext, p_s, p_qx, p_gx);          // (x2-x1)
                Cy_Cryptolite_EC_DivMod(base, cfContext, p_s, dividend, p_s, (int)bitsize);  // s = (y2-y1)/(x2-x1)

                Cy_Cryptolite_EC_SquareMod(base, cfContext, p_s, p_s, (int)bitsize);     // s^2
                Cy_Cryptolite_EC_SubMod(base, cfContext, p_s, p_s, p_gx);           // s^2 - x1
                Cy_Cryptolite_EC_SubMod(base, cfContext, p_s, p_s, p_qx);           // s^2 - x1 - x2 which is Px mod n
            }

            if (Cy_Cryptolite_Vu_test_equal(base, vu_struct0, p_s, p_r, (uint16_t)bitsize))
            {
                *stat = CY_CRYPTOLITE_SIG_VALID;
            }
            else
            {
                *stat = CY_CRYPTOLITE_SIG_INVALID;
            }

            result = CY_CRYPTOLITE_SUCCESS;
        }
    }
    return result;
}
#endif

#endif /*#if (CY_CRYPTOLITE_CFG_ECDSA_C)*/
#endif /* #if (CPUSS_CRYPTOLITE_VU == 1) */

#if defined(__cplusplus)
}
#endif

#endif /* CY_IP_MXCRYPTOLITE */
